## Data Frame

In [ ]:
# Dataframe is a labeled 2-dimensional array, It contains multiple rows and columns.
# Eacah column of dataframe act as series. Hence, Dataframe is nothing but collection of series objects.

In [1]:
import pandas as pd

eno = [10,20,30,40]
ename = ["nikhil" , "prakriti" , "arun" ,"riya"]
esal = [1000,2000,3000,4000]
eadrs = ["delhi" , "delhi" , "rishikesh" , "shimla"]

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno     ename  esal      eadrs
0   10    nikhil  1000      delhi
1   20  prakriti  2000      delhi
2   30      arun  3000  rishikesh
3   40      riya  4000     shimla

In [2]:
print(df.ndim)
print(df.shape)

2
(4, 4)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
type(df.ename)

pandas.core.series.Series

In [7]:
df.dtypes    # for 2-d we need to use dtypes

eno       int64
ename    object
esal      int64
eadrs    object
dtype: object

In [8]:
import pandas as pd

eno = [10,"ram",30.5,"a"]

s = pd.Series(eno)
s

0      10
1     ram
2    30.5
3       a
dtype: object

In [ ]:
# various ways to create dataframe object

In [ ]:
# 1.  from dict of list objects 
# here each key acts as column name and value is list of values for that column

In [12]:
import pandas as pd

df = pd.DataFrame({'employe name':['nikhil',"prakriti",'rajat','nitin','akhil','seeta','tina'],"employe add..":['Delhi','Bulandshahr','Gulaothi','Delhi','Ghaziabad','Gulaothi','Fridabad']})
df

  employe name employe add..
0       nikhil         Delhi
1     prakriti   Bulandshahr
2        rajat      Gulaothi
3        nitin         Delhi
4        akhil     Ghaziabad
5        seeta      Gulaothi
6         tina      Fridabad

In [ ]:
# 2. from dict of tuple objects
# instead of list objects we can use tuple objects also

In [13]:
import pandas as pd

eno = (10,20,30,40)
ename = ("nitin" , "tina" , "arun" ,"riya")
esal = (1000,2000,3000,4000)
eadrs = ("doon" , "delhi" , "rishikesh" , "shimla")

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla

In [ ]:
# 3. from dict of series objects

# dataframe is nothing bt collection of series objects

In [14]:
import pandas as pd

eno = pd.Series([10,20,30,40])
ename = pd.Series(["nitin" , "tina" , "arun" ,"riya"])
esal = pd.Series([1000,2000,3000,4000])
eadrs = pd.Series(["doon" , "delhi" , "rishikesh" , "shimla"])

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla

In [ ]:
# 4. from dict of dicts

In [15]:
import pandas as pd

eno = {0:10,1:20,3:30,4:40}
ename = {0:"nitin" , 1:"tina" , 2:"arun" ,3:"riya"}
esal = {0:1000,1:2000,2:3000,3:4000}
eadrs = {0:"doon" , 1:"delhi" , 2:"rishikesh" , 3:"shimla"}

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

    eno  ename    esal      eadrs
0  10.0  nitin  1000.0       doon
1  20.0   tina  2000.0      delhi
3  30.0   riya  4000.0     shimla
4  40.0    NaN     NaN        NaN
2   NaN   arun  3000.0  rishikesh

In [16]:
# 5. from list of dicts

In [17]:
import pandas as pd

df = pd.DataFrame([{"eno":10, "ename":"tina" , "esal":1000 , "eadrs":"rishikesh"},
                  {"eno":20, "ename":"nitin" , "esal":2000 , "eadrs":"delhi"},
                  {"eno":30, "ename":"riya" , "esal":3000 , "eadrs":"doon"},
                  {"eno":40, "ename":"sachin" , "esal":4000 , "eadrs":"shimla"}])
df

   eno   ename  esal      eadrs
0   10    tina  1000  rishikesh
1   20   nitin  2000      delhi
2   30    riya  3000       doon
3   40  sachin  4000     shimla

In [ ]:
# --------------------------------------------------------------------------------------

In [18]:
import pandas as pd

In [19]:
# write data series
ds1 = pd.Series([1,2,434,46,24,75,24,35,"data series"])
ds1

0              1
1              2
2            434
3             46
4             24
5             75
6             24
7             35
8    data series
dtype: object

In [4]:
ds2 = pd.Series([1,32,465,23,7,34], index = ["a","b",'c','d','e','f'])
ds2

a      1
b     32
c    465
d     23
e      7
f     34
dtype: int64

In [7]:
# write data frame
data = pd.DataFrame({'name':['nikhil','prakriti','chunmun'],'marks':[78,98,94]})
data

       name  marks
0    nikhil     78
1  prakriti     98
2   chunmun     94

In [8]:
df = pd.read_csv('d:list.csv',delimiter=",")

In [9]:
df

       name  age gender
0    nikhil   19      m
1     nitin   35      m
2      yogi   25      m
3  prakriti   17      f
4    sakshi   18      f
5    ananya   18      f
6     priya   17      f

In [10]:
df["gender"].value_counts()

f    4
m    3
Name: gender, dtype: int64

In [11]:
df.shape

(7, 3)

In [12]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

In [13]:
df.head()

       name  age gender
0    nikhil   19      m
1     nitin   35      m
2      yogi   25      m
3  prakriti   17      f
4    sakshi   18      f

In [14]:
df.head(3)

     name  age gender
0  nikhil   19      m
1   nitin   35      m
2    yogi   25      m

In [15]:
df.tail()

       name  age gender
2      yogi   25      m
3  prakriti   17      f
4    sakshi   18      f
5    ananya   18      f
6     priya   17      f

In [16]:
# axis = 0 - row
# axis = 1 - column

df.drop("age",axis=1)

       name gender
0    nikhil      m
1     nitin      m
2      yogi      m
3  prakriti      f
4    sakshi      f
5    ananya      f
6     priya      f

In [17]:
df.drop([2,3,5],axis=0)

     name  age gender
0  nikhil   19      m
1   nitin   35      m
4  sakshi   18      f
6   priya   17      f

In [18]:
df.tail(1)

    name  age gender
6  priya   17      f

In [19]:
df = pd.read_csv('d:list1.csv',delimiter=",",header=None)
df

          0   1  2
0    nikhil  19  m
1     nitin  35  m
2      yogi  25  m
3  prakriti  17  f
4    sakshi  18  f
5    ananya  18  f
6     priya  17  f

In [21]:
df.columns=['name','age','gender']
df

       name  age gender
0    nikhil   19      m
1     nitin   35      m
2      yogi   25      m
3  prakriti   17      f
4    sakshi   18      f
5    ananya   18      f
6     priya   17      f

In [22]:
df['name'][4]

'sakshi'

In [23]:
# df.iloc[row,column]
df.iloc[:,1:3]

   age gender
0   19      m
1   35      m
2   25      m
3   17      f
4   18      f
5   18      f
6   17      f

In [19]:
for i in df.index:
    print(df["age"][i])

19
35
25
17
18
18
17

In [24]:
df.loc[2:4]

       name  age gender
2      yogi   25      m
3  prakriti   17      f
4    sakshi   18      f

In [25]:
df.sort_values("age")

       name  age gender
3  prakriti   17      f
6     priya   17      f
4    sakshi   18      f
5    ananya   18      f
0    nikhil   19      m
2      yogi   25      m
1     nitin   35      m

In [26]:
#sum of ages 
s = 0
for i in df.index:
    s=s+(df["age"][i])
print(s)

149

In [23]:
#count a in name
c = 0
for i in df.index:
    for j in df['name'][i]:
        if j=="a":
            c=c+1
print(c)

6

In [27]:
#reverse of all chracters
for i in df.index:
    print(df["name"][i][::-1])

lihkin
nitin
igoy
itirkarp
ihskas
aynana
ayirp

In [28]:
df['total']=0
df

       name  age gender  total
0    nikhil   19      m      0
1     nitin   35      m      0
2      yogi   25      m      0
3  prakriti   17      f      0
4    sakshi   18      f      0
5    ananya   18      f      0
6     priya   17      f      0

In [29]:
for i in df.index:
    total=0
    for j in (df["name"][i]):
        if j in "aeiou":
            total+=1
    df['total'][i]=total

<ipython-input-29-3e36193becd6>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['total'][i]=total

In [30]:
df

       name  age gender  total
0    nikhil   19      m      2
1     nitin   35      m      2
2      yogi   25      m      2
3  prakriti   17      f      3
4    sakshi   18      f      2
5    ananya   18      f      3
6     priya   17      f      2

In [28]:
df['odd/even']=0
df

       name  age gender  total  odd/even
0    nikhil   19      m      2         0
1     nitin   35      m      2         0
2      yogi   25      m      2         0
3  prakriti   17      f      3         0
4    sakshi   18      f      2         0
5    ananya   18      f      3         0
6     priya   17      f      2         0

In [29]:
for i in df.index:
    print(df["age"][i])
    if (df["age"][i])%2==0:
        df['odd/even'][i]="even"
    else:
        df['odd/even'][i]="odd"
        
df

19
35
25
17
18
18
17

<ipython-input-29-ae4c9707f380>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['odd/even'][i]="odd"
C:\Users\JP Computer\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)
<ipython-input-29-ae4c9707f380>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['odd/even'][i]="even"

       name  age gender  total odd/even
0    nikhil   19      m      2      odd
1     nitin   35      m      2      odd
2      yogi   25      m      2      odd
3  prakriti   17      f      3      odd
4    sakshi   18      f      2     even
5    ananya   18      f      3     even
6     priya   17      f      2      odd

In [30]:
import pandas
df= pandas.read_csv('d:data1.csv',delimiter=",")
df

          Date Description   Deposits  Withdrawls    Balance
0   20-08-2020        NEFT   23237.00        0.00   37243.31
1   20-08-2020        NEFT       0.00     3724.33   33518.98
2   20-08-2020  Commission     245.00        0.00   33763.98
3   20-08-2020        NEFT   12480.00        0.00   46243.98
4   20-08-2020        RTGS       0.00    11561.00   34682.98
..         ...         ...        ...         ...        ...
95  21-08-2020  Debit Card       2.78        0.00   51023.28
96  21-08-2020  Commission  300660.00        0.00  351683.28
97  21-08-2020        IMPS       0.00    87920.82  263762.46
98  21-08-2020         ATM       0.00    26376.25  237386.21
99  21-08-2020    Transfer  193326.38        0.00  430712.59

[100 rows x 5 columns]

In [31]:
df.dtypes

Date            object
Description     object
Deposits       float64
Withdrawls     float64
Balance        float64
dtype: object

In [32]:
s = 0
for i in df.index:
    s=s+(df["Balance"][i])
print(s)

74404184.84999995

In [3]:
df=df.loc[0:5]

NameError: name 'df' is not defined

In [2]:
df

NameError: name 'df' is not defined

In [1]:
df["Balance"].mean()

NameError: name 'df' is not defined

In [35]:
s = 0
for i in df.index:
    s=s+(df["Balance"][i])
print(s)

308872.21

In [36]:
import pandas as pd
df=pandas.read_csv("d:list.csv")
df

       name  age gender
0    nikhil   19      m
1     nitin   35      m
2      yogi   25      m
3  prakriti   17      f
4    sakshi   18      f
5    ananya   18      f
6     priya   17      f

In [10]:
data=pd.read_csv("d:name.csv")

In [11]:
data

         name  age
0  ni#$%#khil   29
1    y$%#@ogi   26

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("d:df.csv")

In [3]:
df

     name  pass
0  nikhil  9027
1    yogi  8075
2   mitar  2025
3   rahul  8787

In [4]:
df = df.append({"name":"nisha","password":"1234"},ignore_index=True)

In [5]:
df

     name    pass password
0  nikhil  9027.0      NaN
1    yogi  8075.0      NaN
2   mitar  2025.0      NaN
3   rahul  8787.0      NaN
4   nisha     NaN     1234

In [6]:
a=input("enter your username")
b=int(input("enter your password"))
if a in list(df['name']):
    n=list(df['name']).index(a)
    if (df['pass'][n]==b):
        print('welcome')
    else:
        print('incorrect pass')
else:
    print("username not found")
    d=input('Press 1 if you want to create your profile')
    flag=0
    cd=0
    if(d=='1'):
        while(flag!=1):
            new=input("enter your username")
            if new in list(df['name']):
                print('username already exist')
            else:
                flag=1
                while(cd!=1):
                    ps=int(input('enter your password'))
                    re=int(input('enter your password again'))
                    if(ps==re):
                        print('password matched account created')
                        df=df.append({'name':new,'pass':ps},ignore_index=True)
                        df.to_csv('d:info.csv',index=False)
                        cd=1
                    else:
                        print('please enter your password again')

enter your usernamenikhil
enter your password7650
incorrect pass